Tekla.Structures.Drawing.DimensionBase
The DimensionBase class is the common base class for all the different dimensions.

Tekla.Structures.Drawing.DimensionBase.GetDimensionSet
Gets the dimension set the current dimension belongs to.
Returns: The dimension set the current dimension belongs to.

Tekla.Structures.Drawing.DimensionBase.GetDimensionSet(System.Boolean)
Gets the dimension set the current dimension belongs to.
Select: Whether to select the object from the database or not.
Returns: The dimension set the current dimension belongs to.

Tekla.Structures.Drawing.DimensionBase.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
An interface for calling core functions. New query types are added to DrawingObject.
QueryType: The type of the query. See more details from DrawingObject.
Returns: True on success.

Tekla.Structures.Drawing.DimensionBase.Hideable
Accesses the information if this object is hidden or not or if it should be.